[
    "Roll on this table at the start of each of your turns for the next minute, ignoring this result on subsequent rolls",
    "Roll again on this table twice, re-rolling dice rolls of 2",
    "For the next minute, you can see any invisible creature if you have line of sight to it",
    "For the next minute, hidden traps, doors, and other secret mechanizms within 60 feet of you are outlined to you in red. These outlines are visible through objects and walls.",
    "A modron chosen and controlled by the DM appears in a space within 5 ft of you, then disappears 1 minute later.",
    "A Dwarven blacksmith controlled by the DM appears in an unoccupied space within 5 ft of you, then disappears 1 minute later.  He has a bag of basic weapons and armor for sale",
    "You cast *Fireball* as a 3rd-level spell centered on yourself",
    "You cast *Ice Storm* as a 4th-level spell centered on yourself",
    "You cast *Magic Missile* as a 5th-level spell.",
    "You cast *Scorching Ray* as a 2nd-level spell.",
    "Roll a d10. Your height changes by a number of inches equal to the roll. If the roll is odd, you shrink. If the roll is even, you grow.",
    "Roll a d20. Your race changes, but your racial traits do not change except for your size and movement/flight speed. See the bottom of the list for the d20 results.",
    "You cast *Confusion* centered on yourself.",
    "You cast *Hold Person* on yourself",
    "For the next minute, you regain 5 hp at the start of each of your turns.",
    "For the next minute, your allies within 30 ft of you gain 5 temporary hit points that reset back to 5 at the start of each of their own turns.",
    "You grow a long beard made of feathers that remains until you sneeze, at which point the feathers explode out from your face.",
    "You grow a beautiful flower from the top of your head that remains until someone plucks it. Once plucked, the flower dies after 1d4 days.",
    "You cast *Grease* centered on yourself",
    "You cast *Entangle* cenetered on yourself. Creatures entering the area are also subjected to a saving throw.",
    "Creatures have disadvantage on saving throws against the next spell you cast in the next minute that involves a saving throw",
    "Allies have advantage on saving throws agains the next spell cast in the next minute that involves a saving throw.",
    "Your skin turns a vibrant shade of blue. A *Remove Curse* spell can end this effect", 
    "You produce a faint aroma of lavender that is only detectable when sharing the same 5 ft space with someone. A *Remove Curse* spell can end this effect.",
    "An eye appears on your forehead for the next minute. During that time, you have advantage on Wisdom (Perception) checks that rely on sight.",
    "An extra arm appears on your body for the next minute. During that time, you have advantage when performing the *Grapple* action or when attempting to escape a grapple.", 
    "For the next minute, all your spells with a casting time of 1 action have a casting time of 1 bonus action",
    "For the next minute, all your spells with a casting time of 1 action allow you to move an extra 15 ft when cast. Your movement does not provoke an attack of opportunity.",
    "You can teleport up to 60 ft to an unoccupied space of your choice you can see.",
    "You and a creature of your choice within 60 ft of you teleport simultaneously, swapping positions with each other. You may then move an additional 30 ft.",
    "You are transported to the Astral Plane until the end of your next turn. You return to your previously occupied space or the nearest unoccupied space if unable to do so",
    "A creature of your choice is transported to the Nine Hells until the end of their next turn. They return to their previously occupied space, or the nearest unoccupied space if unable to do so, and are frightened until the end of their next turn",
    "Maximise the damage of the next damaging spell you cast within thenext minute.",
    "Your next damaging spell you cast within the next minute knocks your target prone and blinds them for one minute.",
    "Roll a d10. Your age changes by a number of years equal to the roll. If the roll is odd, you get younger (minimum one year old). If the roll is even, you get older.",
    "Roll a d4. Your voice changes pitch by a number of octaves equal to the roll. If the roll is odd, your voice gets deeper. If the roll is even, your voice gets higher. A *Remove Curse* spell can restore your voice to normal.",
    "1d6 flumphs controlled by the DM appear in unoccupied spaces within 60ft of you and are frightened of you. They vanish after 1 minute.",
    "1d6 confused badgers controlled by the DM appear in unoccuped spaces within 60ft of you. They vanish after 1 minute.",
    "You regain 2d10 hp",
    "All allies within 30 ft of you regain 1d10 hp",
    "You turn into a potted plant until the start of your next turn. While a plant, you are incapacitated and have vulnerability to all damage. If you drop to 0 hp, your pot breaks, and your form reverts.",
    "You hallucinate and perceive creatures as farm animals until the end of your next turn. While hallucinating, you are incapacitated and attacks against you have advantage.",
    "For the next minute, you can teleport up to 20 ft as a bonus action on each of your turns.",
    "For the next minute you are able to defy gravity, allowing you to fly 20 ft as a bonus action on each of your turns.",
    "You cast *Levitate* on yourself.",
    "You cast *Feather Fall* on yourself.",
    "A unicorn controlled by the DM appears in a space within 5 ft of you, then disappears 1 minute later.",
    "A compliant riding horse appears in an unoccupied space within 5 ft of you, then disappears 1 hour later.",
    "You can't speak for the next minute. Whenever you try, pink bubbles float out of your mouth.",
    "You cry uncontrollably for the next minute. Whenever you try to speak through your tears, snot shoots out from your nose.",
    "A spectral shield hovers near you for the next minute, granting you a +2 bonus to AC and an immunity to *Magic Missile*",
    "A large banana appears on your shoulder for the next minute, granting you a +2 to all saving throws and immunity to being moved or knocked prone.",
    "You are immune to being intoxicated by alcohol for the next 5d6 days",
    "You are immune to becoming addicted to substances for the next 5d6 days. Any current addictions disappear for that time",
    "Your hair falls out but grows back within 24 hours",
    "Your body immediately sprouts hair from head to toe, to a length of 6 inches. The hair remains until you shave it off.",
    "For the next minute, any flammable object you touch that isn't being worn or carried by another creature bursts into flame.",
    "For the next minute, any object or 2x2 foot area of liquid that you touch that isn't being worn or carried by another creature instantly freezes.",
    "You regain your lowest-level expended spell slot.",
    "Only once for the next minute, gain one free use of any metamagic on your turn",
    "For the next minute, you must shout when you speak.",
    "For the next minute, you must whisper when you speak.",
    "You cast *Fog Cloud* centered on yourself",
    "You cast *Silence* centered on yourself",
    "Up to three creatures you choose within 30 ft of you take 4d10 lightning damage.",
    "Up to four creatures you choose within 60 ft of you are knocked prone by a mysterious force.",
    "You are frightened by the nearest creature until the end of your next turn.",
    "You are charemed by the nearest creature until the end of your next turn.",
    "Each creature within 30 ft of you becomes invisible for the next minute. The invisibility ends on a creature when it attacks or casts a spell.",
    "For one minute, a random creature becomes invisible at the beginning of each round. The invisibility lasts indefinitely, only ending at the end of each round.",
    "You gain resistance to all damage for the next minute.",
    "You gain advantage against all saving throws for the next minute.",
    "A random creature within 60 ft of you becomes poisoned for 1d4 hours.",
    "A random creature within 60 ft of you suffers from 2 levels of exhaustion for 1d4 hours.",
    "You glow with a bright light in a 30-ft radius for the next minute. Any creature that ends its turn within 5 ft of you is blinded until the end of its next turn.",
    "You radiate a chilling mist in a 30-ft radius for the next minute. Any creature that ends its turn within 5 ft of you is incapacitated until the end of its next turn.",
    "You cast *Polymorph* on yourself. If you fail the saving throw, you turn into a sheep for the spell's duration.",
    "You cast *Flesh to Stone* on yourself. Roll only once to determine a success or failure. A failure petrifies you instantly, and lasts only 1 minute.",
    "Illusory butterflies and flower petals flutter in the air within 10 ft of you for the next minute.",
    "Static electricity fills you for the next minute. Within 10 ft of you, hairs stand on their ends, and feather-light objects slowly cling to you.",
    "You can take one additional action immediately.",
    "The next friendly creature in the initiative order may take one additional action on their turn, and receive temporary hp equal to their character level.",
    "Each creature within 30 ft of you takes 1d10 necrotic damage. You regain hp equal to the sum of the necrotic damage dealt.",
    "Creatures within 30 ft of you make a Con save against your spell DC. On a fail, a creature temporarily suffers -1 to their AC and saving throws. For one minute, you receive a bonus to your AC and saving throws equal to a sum of failures.",
    "You cast *Mirror Image*.",
    "You cast *Blur*.",
    "You cast *Fly* on a random creature within 60ft of you.",
    "For the next ten minutes, a random creature within 60 ft of you receives the *Earth Glide* property with a burrow speed of 30 ft. If the effect ends while burrowing, the creature is flung out 30 ft and is stunned until the end of their next turn.",
    "You become invisible for the next minute. During that time, other creatures can't hear you. The invisibility ends if you attack or cast a spell.",
    "You become and illusion for the next minute. You seem completely real, from sounds to smell. Physial interaction with you or an investigation check against your spell save DC reveals you are an illusion because things and spells pass through you. The effect ends if you attack or cast a spell",
    "If you die within the next minute, you immediately come back to life as if by the *Reincarnate* spell.",
    "If you die within the next minute, you immediately come back to life. For the next 1d4 hours, you gain a fly speed of 60 ft and may take an additional action on your turns. Creatures witnessing your resurrection are frightened for one minute.",
    "Your size increases by one size category for the next minute.",
    "Your size decreases by one size category for the next minute.",
    "You and all creatures within 30 ft of you gain vulnerability to piercing damage for the next minute.",
    "Excluding you, all creatures within 30 ft of you gain resistance to piercing damage for the next minute.",
    "You are surrounded by faint, ethereal music for the next minute.",
    "You  are surrounded by loud, obnoxious, and erratically off-tune flute noises for the next minute.",
    "You regain all expended sorcery points.",
    "You regain all expended spell slots"
]